In [1]:
import pandas as pd

In [2]:
host = 'localhost'
port = 3306
username = 'root'
password = 'root'
database = 'sakila'
protocol = 'mysql://'
conn = f'{protocol}{username}:{password}@{host}:{port}/{database}'
print (conn)

mysql://root:root@localhost:3306/sakila

In [15]:
query = "Select * from actor"
pd.read_sql(query, con=conn)

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

In [ ]:
query = ""